src/InformationRegisters/кфкВходящиеСообщения/кфкВходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f414732c-dcdc-4e52-825c-4b00cf4fa6e2">
  <name>кфкВходящиеСообщения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="40e13da9-a528-4570-883e-2c907efb0364">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b7a46c86-21a3-43b1-9f53-d74a8fdccb2f">
    <name>Заголовки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="40670889-dab8-4e97-83f0-746662cb9168">
    <name>ТелоСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="bd26b858-29df-4c6e-ba4a-75d5f9a60683">
    <name>Консьюмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01079ff5-5033-46d9-af80-34e06690eabd">
    <name>Топик</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="674a635a-7c60-483a-aa26-18543e47cd4e">
    <name>Раздел</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f6fdbc5d-cd8b-4e9f-aef2-14902fcd3d2b">
    <name>Смещение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9504695b-0eb6-4677-b1ca-4823a52689aa">
    <name>КлючСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="09c9dd9a-de2f-4730-a615-93cb72742570">
    <name>ДатаЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bfe7b38d-d429-4caa-b272-7de24cf9ca09">
    <name>ДатаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf1cd89a-5799-49dd-be8b-f171cd5245a8">
    <name>ДатаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f591f9ce-cc6e-447d-9dbb-d8f97d14b471">
    <name>ДлОбработкиМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b6867e51-27ef-412a-8310-5e541572a80d">
    <name>ТекстЖурнала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5ce30598-30ab-4cb8-8e33-07a80a4c3ca5">
    <name>КоличествоОбработок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d7d9478d-81b5-41b6-aef7-75804ffeda2f">
    <name>МеткаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="f5651cfa-879f-4b36-a83a-fd15928fdcb5">
    <name>КлючЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="111ca233-437e-423e-bb9a-fac72f0cf50c">
    <name>МеткаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкСтатусыСообщений/кфкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="90c87861-83c3-4174-81dd-550f291515d7">
  <name>кфкСтатусыСообщений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e87ed46a-b4fe-41ad-a05b-c7d43a993d59">
    <name>Новое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4aa47c21-1293-47d6-b3ab-9d29a043b1dc">
    <name>Обработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82907498-6643-4090-a81d-dd1982638a68">
    <name>ОбработкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bb65cb4f-750e-4084-b787-633ed9393166">
    <name>ОшибкаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="31aa5e8e-008e-4e64-bdea-a9307ad0bcc1">
    <name>Выгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2aad9bb4-aca4-411a-8268-a2c8d7a9efe8">
    <name>ОшибкаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b1566b75-70c6-497a-8ff6-bdaa91eddbbe">
    <name>ВыгрузкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ОМ_кфкФоновыеОперацииСлужебный_Стенд/Module.bsl
// Проверки реального цикла обработки входящих в фоновом задании.

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ВТранзакции(Ложь)
		.После("ПослеКаждогоТеста")
		.ДобавитьТестовыйНабор("Фоновый цикл входящих сообщений")
			.Тег("Модульные").Тег("кфкФоновыеОперацииСлужебный").Тег("Стендовые")
			.Тег("ЦиклДесериализации")
			.ДобавитьСерверныйТест("ЦиклДесериализации_УчитываетБлокировкуИПоступление")
				.Тег("УчитываетБлокировкуИПоступление")
				.СПараметрами("до")
				.СПараметрами("между")
				.СПараметрами("поступление")
			.ДобавитьСерверныйТест("ЦиклДесериализации_ПустойПотокЗавершаетсяПоТаймауту")
				.Тег("ПустойПотокЗавершаетсяПоТаймауту");

КонецПроцедуры

// Освобождает только ресурсы текущего стендового запуска.
Процедура ПослеКаждогоТеста() Экспорт

	Контекст = ЮТест.КонтекстТеста();
	Ресурсы = Неопределено; // Структура, Неопределено
	Если Не Контекст.Свойство("ют_РесурсыФоновогоЦикла", Ресурсы) Тогда
		Возврат;
	КонецЕсли;
	Константы.кфкБлокировкаИнтеграции.Установить(Истина);
	ОбновитьПовторноИспользуемыеЗначения();
	Если Ресурсы.Задание <> Неопределено Тогда
		Задание = Ресурсы.Задание.ОжидатьЗавершенияВыполнения(1);
		Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Задание.Отменить();
			Задание = Задание.ОжидатьЗавершенияВыполнения(10);
		КонецЕсли;
		ЮТест.ОжидаетЧто(Задание.Состояние = СостояниеФоновогоЗадания.Активно,
			"Тестовое фоновое задание остановлено").Равно(Ложь);
	КонецЕсли;
	Для Каждого Ключ Из ЮТМетоды.МассивПараметров(Ресурсы.Первый, Ресурсы.Второй) Цикл
		Назначение = РегистрыСведений.кфкОчередьПотоков.СоздатьМенеджерЗаписи();
		Назначение.Ключ = Ключ;
		Назначение.Удалить();
	КонецЦикла;
	Для Индекс = 0 По 1 Цикл
		Запись = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
		Запись.КлючЗаписи = ?(Индекс = 0, Ресурсы.Первый, Ресурсы.Второй);
		Запись.ДатаЗагрузкиМС = 1000000 + Индекс;
		Запись.Удалить();
	КонецЦикла;
	Константы.кфкБлокировкаИнтеграции.Установить(Ресурсы.Блокировка);
	ОбновитьПовторноИспользуемыеЗначения();
	Контекст.Удалить("ют_РесурсыФоновогоЦикла");

КонецПроцедуры

#Область ЦиклДесериализации

// Проверяет состояние двух сообщений при блокировке до и между порциями.
// Параметры:
//  Режим - Строка - до, между или поступление.
Процедура ЦиклДесериализации_УчитываетБлокировкуИПоступление(Режим) Экспорт

	ЮТест.ОжидаетЧто(СтрНайти(СтрокаСоединенияИнформационнойБазы(), "Srvr=") > 0,
		"Для фонового задания требуется серверная ИБ").Равно(Истина);
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	Первый = "ют-фоновый-цикл-first-" + Идентификатор;
	Второй = "ют-фоновый-цикл-second-" + Идентификатор;
	Консьюмер = ЮТест.Данные().КонструкторОбъекта(Справочники.кфкКонсьюмеры)
		.Установить("Наименование", "Фоновый цикл " + Идентификатор)
		.Установить("Брокер", кфк_т_ТестовыеДанные.СсылкаБрокераПоУмолчанию())
		.Записать(Ложь, Истина);
	ПрежняяБлокировка = Константы.кфкБлокировкаИнтеграции.Получить();
	Ресурсы = Новый Структура("Первый,Второй,Блокировка", Первый, Второй, ПрежняяБлокировка);
	Ресурсы.Вставить("Задание", Неопределено);
	ЮТест.КонтекстТеста().Вставить("ют_РесурсыФоновогоЦикла", Ресурсы);
	Константы.кфкБлокировкаИнтеграции.Установить(Режим = "до");
	ОбновитьПовторноИспользуемыеЗначения();

	Параметры = ЮТМетоды.МассивПараметров(Консьюмер, Первый, Второй, Режим);
	Ресурсы.Задание = кфкФоновыеОперацииСлужебный.ют_ЗапуститьФЗ(
		"ют-фоновый-цикл-" + Идентификатор,
		"ОМ_кфкФоновыеОперацииСлужебный_Стенд.ют_РабочийПоток",
		"Проверка фонового цикла", Параметры);
	Завершенное = Ресурсы.Задание.ОжидатьЗавершенияВыполнения(30);
	ЮТест.ОжидаетЧто(Завершенное.Состояние, "Завершение тестового фонового задания")
		.Равно(СостояниеФоновогоЗадания.Завершено);
	ПервыйСтатус = ?(Режим = "до", Перечисления.кфкСтатусыСообщений.Новое,
		Перечисления.кфкСтатусыСообщений.Обработано);
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
		.СодержитЗаписи(ЮТест.Предикат()
			.Реквизит("КлючЗаписи").Равно(Первый)
			.Реквизит("Статус").Равно(ПервыйСтатус));
	Если Режим = "до" Тогда
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
			.НеСодержитЗаписи(ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(Второй));
	Иначе
		ВторойСтатус = ?(Режим = "между", Перечисления.кфкСтатусыСообщений.Новое,
			Перечисления.кфкСтатусыСообщений.Обработано);
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
			.СодержитЗаписи(ЮТест.Предикат()
				.Реквизит("КлючЗаписи").Равно(Второй)
				.Реквизит("Статус").Равно(ВторойСтатус));
	КонецЕсли;
	Для Каждого Ключ Из ЮТМетоды.МассивПараметров(Первый, Второй) Цикл
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкОчередьПотоков")
			.НеСодержитЗаписи(ЮТест.Предикат().Реквизит("Ключ").Равно(Ключ));
	КонецЦикла;

КонецПроцедуры

// Проверяет завершение пустого фонового потока после управляемого срока простоя.
Процедура ЦиклДесериализации_ПустойПотокЗавершаетсяПоТаймауту() Экспорт

	ЮТест.ОжидаетЧто(СтрНайти(СтрокаСоединенияИнформационнойБазы(), "Srvr=") > 0,
		"Для фонового задания требуется серверная ИБ").Равно(Истина);
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	ПрежняяБлокировка = Константы.кфкБлокировкаИнтеграции.Получить();
	Ресурсы = Новый Структура("Первый,Второй,Блокировка",
		"ют-фоновый-цикл-empty-first-" + Идентификатор,
		"ют-фоновый-цикл-empty-second-" + Идентификатор,
		ПрежняяБлокировка);
	Ресурсы.Вставить("Задание", Неопределено);
	ЮТест.КонтекстТеста().Вставить("ют_РесурсыФоновогоЦикла", Ресурсы);
	Константы.кфкБлокировкаИнтеграции.Установить(Ложь);
	ОбновитьПовторноИспользуемыеЗначения();

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Ресурсы.Задание = кфкФоновыеОперацииСлужебный.ют_ЗапуститьФЗ(
		"ют-фоновый-цикл-timeout-" + Идентификатор,
		"ОМ_кфкФоновыеОперацииСлужебный_Стенд.ют_ПустойПоток",
		"Проверка таймаута фонового цикла", Новый Массив);
	Завершенное = Ресурсы.Задание.ОжидатьЗавершенияВыполнения(30);
	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;
	ЮТест.ОжидаетЧто(Завершенное.Состояние,
		Строка(Завершенное.ИнформацияОбОшибке)).Равно(СостояниеФоновогоЗадания.Завершено);
	ЮТест.ОжидаетЧто(Длительность >= 4000, "Цикл дождался таймаута после пустой выборки")
		.Равно(Истина);
	ЮТест.ОжидаетЧто(Длительность < 30000, "Поток завершился после таймаута")
		.Равно(Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТестов

// Выполняется в настоящем фоновом задании и создаёт первую назначенную запись.
// Параметры:
//  Консьюмер - СправочникСсылка.кфкКонсьюмеры
//  Первый - Строка
//  Второй - Строка
//  Режим - Строка
Процедура ют_РабочийПоток(Консьюмер, Первый, Второй, Режим) Экспорт

	Поток = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание().УникальныйИдентификатор;
	ЗаписатьСообщениеСтенда(Консьюмер, Первый, 1000000, Режим + "|" + Второй, Поток);
	Правило = кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена();
	Правило.Тип = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	Правило.ИмяМетода = "ОМ_кфкФоновыеОперацииСлужебный_Стенд.ют_ПослеСообщения";
	Правила = Новый Соответствие;
	Правила.Вставить(НРег(XMLСтрока(Консьюмер) + "unit-background-cycle"), Правило);
	кфкФоновыеОперацииСлужебный.ДесериализацияСообщенийВПотоке(Правила, Новый Массив);

КонецПроцедуры
// Вызывает исходный цикл без назначенных записей внутри тестового фонового задания.
Процедура ют_ПустойПоток() Экспорт

	кфкФоновыеОперацииСлужебный.ДесериализацияСообщенийВПотоке(
		Новый Соответствие, Новый Массив);

КонецПроцедуры


// После первой порции создаёт вторую; после второй завершает цикл блокировкой.
// Параметры:
//  Тело - Строка
//  Свойства - Структура
//  Журнал - Строка
//  Отказ - Булево
Процедура ют_ПослеСообщения(Тело, Свойства, Журнал, Отказ) Экспорт

	Если Тело = "second" Тогда
		Константы.кфкБлокировкаИнтеграции.Установить(Истина);
		ОбновитьПовторноИспользуемыеЗначения();
		Возврат;
	КонецЕсли;
	Части = СтрРазделить(Тело, "|");
	Второй = Части[1];
	Поток = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание().УникальныйИдентификатор;
	ЗаписатьСообщениеСтенда(Свойства.Консьюмер, Второй, 1000001, "second", Поток);
	Если Части[0] = "между" Тогда
		Константы.кфкБлокировкаИнтеграции.Установить(Истина);
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создаёт отдельную входящую запись и назначение текущему заданию.
// Параметры:
//  Консьюмер - СправочникСсылка.кфкКонсьюмеры
//  Ключ - Строка
//  Метка - Число
//  Тело - Строка
//  Поток - УникальныйИдентификатор
Процедура ЗаписатьСообщениеСтенда(Консьюмер, Ключ, Метка, Тело, Поток)

	Запись = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
	Запись.КлючЗаписи = Ключ;
	Запись.Консьюмер = Консьюмер;
	Запись.Топик = "unit-background-cycle";
	Запись.ДатаЗагрузкиМС = Метка;
	Запись.МеткаИзмененияМС = Метка;
	Запись.Статус = Перечисления.кфкСтатусыСообщений.Новое;
	Запись.ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Тело);
	Запись.Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Новый Соответствие);
	Запись.Записать();
	Назначение = РегистрыСведений.кфкОчередьПотоков.СоздатьМенеджерЗаписи();
	Назначение.Ключ = Ключ;
	Назначение.ВременнаяМетка = Метка;
	Назначение.ИдентификаторПотока = Поток;
	Назначение.Записать();

КонецПроцедуры

#КонецОбласти
